thumb2/nrf51sdk12_3/components/drivers_nrf/usbd/nrf_drv_usbd.c
            p_state->transfer_left.size = 0;
            p_state->transfer_set.size  = 0;
            p_state->status = NRF_USBD_EP_ABORTED;
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_ABORTED);
            m_event_handler(&evt);
        }
    }
    CRITICAL_REGION_EXIT();
}

void usbd_drv_ep_abort(nrf_drv_usbd_ep_t ep)
{
    usbd_ep_abort(ep);
}


/**
 * @brief Abort all pending endpoints
 *
 * Function aborts all pending endpoint transfers.
 */
static void usbd_ep_abort_all(void)
{
    uint32_t ep_waiting = m_ep_dma_waiting | (m_ep_ready & USBD_EPOUT_BIT_MASK);
    while(0 != ep_waiting) {
        uint8_t bitpos = __CLZ(__RBIT(ep_waiting));
        usbd_ep_abort(bit2ep(bitpos));
        ep_waiting &= ~(1U << bitpos);
    }

    m_ep_ready = (((1U<<NRF_USBD_EPIN_CNT) - 1U) << USBD_EPIN_BITPOS_0);
}

/**
 * @brief Safely call next transfer callback
 *
 * Function safely calls next transfer callback.
 *
 * @param[in,out] p_state Endpoint state structure pointer.
 *                        The callback function pointer is located here,
 *                        but also the structure with transfer information - this one might be updated.
 *
 * @retval false There is no new data or not even the next transfer callback function.
 * @retval true  There is new data to transfer (it can be also ZLP).
 */
static bool usbd_next_transfer_safe_call(usbd_drv_ep_state_t * p_state)
{
    if(NULL == p_state->handler_desc.handler)
        return false;
    bool ret;
    ret = p_state->handler_desc.handler(&(p_state->transfer_set), p_state->handler_desc.p_context);
    if(ret) {
        p_state->transfer_left = p_state->transfer_set;
    }
    return ret;
}

/**
 * @name Auxiliary functions for global interrupt state
 *
 * This functions are manipulating interrupt state on NVIC level.
 * In the target USBD API there would be only one interrupt.
 * So for RawIP we can only enable all interrupts or disable them.
 * @{
 */

/**
 * Enable USBD interrupt
 */
static inline void usbd_int_enable(void)
{
    NVIC_EnableIRQ(USBD_IRQn);
}

/**
 * Disable USBD interrupt
 */
static inline void usbd_int_disable(void)
{
    NVIC_DisableIRQ(USBD_IRQn);
}

/**
 * Get current USBD interrupt state
 */
static inline bool usbd_int_state(void)
{
    return nrf_drv_common_irq_enable_check(USBD_IRQn);
}

/**
 * @brief Force the USBD interrupt into pending state
 *
 * This function is used to force USBD interrupt to be processed right now.
 * It makes it possible to process all EasyDMA access on one thread priority level.
 */
static inline void usbd_int_rise(void)
{
    NVIC_SetPendingIRQ(USBD_IRQn);
}

/** @} */

/**
 * @name USBD interrupt runtimes
 *
 * Interrupt runtimes that would be vectorized using @ref m_ivec_isr
 * @{
 */

static void USBD_ISR_Usbreset(void)
{
    m_last_setup_dir = NRF_DRV_USBD_EPOUT0;
    usbd_ep_abort_all();

    const nrf_drv_usbd_evt_t evt = {
        .type = NRF_DRV_USBD_EVT_RESET
    };

    m_event_handler(&evt);
}

static void USBD_ISR_Started(void)
{
#if NRF_DRV_USBD_STARTED_EV_ENABLE
    uint32_t epstatus = nrf_usbd_epstatus_get_and_clear();

    /* All finished endpoint have to be marked as busy */
    // #warning Check this one
    // ASSERT(epstatus == ((~m_ep_ready) & epstatus));
    while (epstatus) {
        uint8_t           bitpos = __CLZ(__RBIT(epstatus));
        nrf_drv_usbd_ep_t ep     = bit2ep(bitpos);
        epstatus                &= ~(1UL << bitpos);

        UNUSED_VARIABLE(ep);
    }
#endif
}

/**
 * @brief Handler for EasyDMA event without endpoint clearing.
 *
 * This handler would be called when EasyDMA transfer for endpoints that does not require clearing.
 * All in endpoints are cleared automatically when new EasyDMA transfer is initialized.
 * For endpoint 0 see @ref nrf_usbd_ep0out_dma_handler
 *
 * @param[in] ep Endpoint number
 */
static inline void nrf_usbd_ep0in_dma_handler(void)
{
    NRF_LOG_DEBUG("USB event: DMA ready IN0\r\n");
    m_dma_pending = 0;

    usbd_drv_ep_state_t * p_state = ep_state_access(NRF_DRV_USBD_EPIN0);

    nrf_drv_usbd_setup_data_clear();

    if(0 == p_state->transfer_left.size) {
        /* Check if there is any new data from callback function */
        if(!usbd_next_transfer_safe_call(p_state)) {
            /* End of transfer */
            UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<ep2bit(NRF_DRV_USBD_EPIN0))));
        }
    } else {
        // nrf_drv_usbd_setup_data_clear();
    }
}

/**
 * @brief Handler for EasyDMA event without endpoint clearing.
 *
 * This handler would be called when EasyDMA transfer for endpoints that does not require clearing.
 * All in endpoints are cleared automatically when new EasyDMA transfer is initialized.
 * For endpoint 0 see @ref nrf_usbd_ep0out_dma_handler
 *
 * @param[in] ep Endpoint number
 */
static inline void nrf_usbd_epin_dma_handler(nrf_drv_usbd_ep_t ep)
{
    NRF_LOG_DEBUG("USB event: DMA ready IN: %x\r\n", ep);
    ASSERT(NRF_USBD_EPIN_CHECK(ep));
    ASSERT(!NRF_USBD_EPISO_CHECK(ep));
    m_dma_pending = 0;

    usbd_drv_ep_state_t * p_state = ep_state_access(ep);

    if(0 == p_state->transfer_left.size) {
        /* Check if there is any new data from callback function */
        if(!usbd_next_transfer_safe_call(p_state)) {
            /* End of transfer */
            UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<ep2bit(ep))));
        }
    }
}

/**
 * @brief Handler for EasyDMA event from in isochronous endpoint
 *
 * @todo RK documentation
 */
static inline void nrf_usbd_epiniso_dma_handler(nrf_drv_usbd_ep_t ep)
{
    ASSERT(NRF_USBD_EPIN_CHECK(ep));
    ASSERT(NRF_USBD_EPISO_CHECK(ep));

    m_dma_pending = 0;

    usbd_drv_ep_state_t * p_state = ep_state_access(ep);
    if (p_state->transfer_left.size == 0) {
        /* Check if there is any new data from callback function */
        if(!usbd_next_transfer_safe_call(p_state)) {
            /* End of transfer */
            UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U << ep2bit(ep))));

