thumb2/nrf51sdk12_3/components/drivers_nrf/usbd/nrf_drv_usbd.c
            /* Send event to the user - for ISO endpoint the whole transfer is finished in this moment */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
            m_event_handler(&evt);
        }
    }
}

/**
 * @brief Handler for EasyDMA event for OUT endpoint 0.
 *
 * EP0 OUT have to be cleared automatically in special way - only in the middle of the transfer.
 * It cannot be cleared when required transfer is finished because it means the same that accepting the comment.
 */
static inline void nrf_usbd_ep0out_dma_handler(void)
{
    NRF_LOG_DEBUG("USB event: DMA ready OUT0\r\n");
    m_dma_pending = 0;

    usbd_drv_ep_state_t * p_state = ep_state_access(NRF_DRV_USBD_EPOUT0);

    if (p_state->transfer_left.size == 0) {
        /* Check if there is any new data buffer from callback function */
        if(!usbd_next_transfer_safe_call(p_state)) {
            /* End of transfer */
            UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<ep2bit(NRF_DRV_USBD_EPOUT0))));
            /* Send event to the user - for OUT endpoint the whole transfer is finished in this moment */

            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, NRF_DRV_USBD_EPOUT0, NRF_USBD_EP_OK);
            m_event_handler(&evt);
            return;
        }
    }

    nrf_drv_usbd_setup_data_clear();
}

/**
 * @brief Handler for EasyDMA event from endpoinpoint that requires clearing.
 *
 * This handler would be called when EasyDMA transfer for OUT endpoint has been finished.
 *
 * @param[in] ep Endpoint number
 *
 */
static inline void nrf_usbd_epout_dma_handler(nrf_drv_usbd_ep_t ep)
{
    NRF_LOG_DEBUG("USB drv: DMA ready OUT: %x\r\n", ep);
    ASSERT(NRF_USBD_EPOUT_CHECK(ep));
    ASSERT(!NRF_USBD_EPISO_CHECK(ep));
    m_dma_pending = 0;

    /* Short transfer should finish */
    usbd_drv_ep_state_t * p_state = ep_state_access(ep);

    if(NRF_USBD_EP_ABORTED == p_state->status) {
        /* Nothing to do - just ignore */
    } else if (p_state->transfer_left.size == 0) {
        /* Check if there is any new data buffer from callback function */
        if(!usbd_next_transfer_safe_call(p_state)) {
            NRF_LOG_DEBUG("USBD drv: epout_dma_handler ep: %02x, NRF_USBD_EP_OK\r\n", ep);
            /* End of transfer */
            UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<ep2bit(ep))));

            /* Send event to the user - for OUT endpoint the whole transfer is finished in this moment */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
            m_event_handler(&evt);
        }
    } else if(nrf_drv_usbd_epout_size_get(ep) < nrf_drv_usbd_ep_max_packet_size_get(ep)) {
        /* Short transfer received - transfer finished */
        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<ep2bit(ep))));
        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
        m_event_handler(&evt);
    }

    nrf_usbd_epout_clear(ep);
#if NRF_DRV_USBD_EARLY_DMA_PROCESS
    /* Speed up */
    usbd_dmareq_process();
#endif
}

/**
 * @brief Handler for EasyDMA event from out isochronous endpoint
 *
 * @todo RK documentation
 */

static inline void nrf_usbd_epoutiso_dma_handler(nrf_drv_usbd_ep_t ep)
{
    ASSERT(NRF_USBD_EPISO_CHECK(ep));

    m_dma_pending = 0;

    usbd_drv_ep_state_t * p_state = ep_state_access(ep);
    if (NRF_USBD_EP_ABORTED == p_state->status) {
        /* Nothing to do - just ignore */
    } else if (p_state->transfer_left.size == 0) {
        /* Check if there is any new data buffer from callback function */
        if(!usbd_next_transfer_safe_call(p_state)) {
            /* End of transfer */
            UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<ep2bit(ep))));

            /* Send event to the user - for OUT endpoint the whole transfer is finished in this moment */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
            m_event_handler(&evt);
        }
    }
}


static void USBD_ISR_dma_epin0(void)
{
    nrf_usbd_ep0in_dma_handler();
}
static void USBD_ISR_dma_epin1(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN1 );
}
static void USBD_ISR_dma_epin2(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN2 );
}
static void USBD_ISR_dma_epin3(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN3 );
}
static void USBD_ISR_dma_epin4(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN4 );
}
static void USBD_ISR_dma_epin5(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN5 );
}
static void USBD_ISR_dma_epin6(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN6 );
}
static void USBD_ISR_dma_epin7(void)
{
    nrf_usbd_epin_dma_handler(NRF_DRV_USBD_EPIN7 );
}
static void USBD_ISR_dma_epin8(void)
{
    nrf_usbd_epiniso_dma_handler(NRF_DRV_USBD_EPIN8 );
}

static void USBD_ISR_dma_epout0(void)
{
    nrf_usbd_ep0out_dma_handler();
}
static void USBD_ISR_dma_epout1(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT1);
}
static void USBD_ISR_dma_epout2(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT2);
}
static void USBD_ISR_dma_epout3(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT3);
}
static void USBD_ISR_dma_epout4(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT4);
}
static void USBD_ISR_dma_epout5(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT5);
}
static void USBD_ISR_dma_epout6(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT6);
}
static void USBD_ISR_dma_epout7(void)
{
    nrf_usbd_epout_dma_handler(NRF_DRV_USBD_EPOUT7);
}
static void USBD_ISR_dma_epout8(void)
{
    nrf_usbd_epoutiso_dma_handler(NRF_DRV_USBD_EPOUT8);
}

static void USBD_ISR_Sof(void)
{
    nrf_drv_usbd_evt_t evt =  {
        NRF_DRV_USBD_EVT_SOF,
        .data = { .sof = { .framecnt = nrf_usbd_framecntr_get() }}
    };

    /* Process isochronous endpoints */
    m_ep_ready |=
        (1U << ep2bit(NRF_DRV_USBD_EPIN8 )) |
        (1U << ep2bit(NRF_DRV_USBD_EPOUT8));

