thumb2/nrf51sdk12_3/components/drivers_nrf/usbd/nrf_drv_usbd.c
    m_event_handler(&evt);
}

/**
 * @brief React on data transfer finished
 *
 * Auxiliary internal function.
 * @param ep     Endpoint number
 * @param bitpos Bit position for selected endpoint number
 */
static void usbd_ep_data_handler(nrf_drv_usbd_ep_t ep, uint8_t bitpos)
{
    NRF_LOG_DEBUG("USBD event: EndpointData: %x\r\n", ep);
    /* Mark endpoint ready for next DMA access */
    m_ep_ready |= (1U<<bitpos);

    if(NRF_USBD_EPIN_CHECK(ep)) {
        /* IN endpoint (Device -> Host) */
        if(0 == (m_ep_dma_waiting & (1U<<bitpos))) {
            NRF_LOG_DEBUG("USBD event: EndpointData: In finished\r\n");

            /* No more data to be send - transmission finished */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OK);
            m_event_handler(&evt);
        }
    } else {
        /* OUT endpoint (Host -> Device) */
        if(0 == (m_ep_dma_waiting & (1U<<bitpos))) {
            NRF_LOG_DEBUG("USBD event: EndpointData: Out waiting\r\n");
            /* No buffer prepared - send event to the application */
            NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_WAITING);
            m_event_handler(&evt);
        }
    }
}

static void USBD_ISR_SetupData(void)
{
    usbd_ep_data_handler(m_last_setup_dir, ep2bit(m_last_setup_dir));
}

static void USBD_ISR_Setup(void)
{
    NRF_LOG_DEBUG("USBD event: Setup (rt:%.2x r:%.2x v:%.4x i:%.4x l:%u )\r\n",
                  nrf_usbd_setup_bmrequesttype_get(),
                  nrf_usbd_setup_brequest_get(),
                  nrf_usbd_setup_wvalue_get(),
                  nrf_usbd_setup_windex_get(),
                  nrf_usbd_setup_wlength_get());
    uint8_t bmRequestType = nrf_usbd_setup_bmrequesttype_get();


    if((m_ep_dma_waiting | ((~m_ep_ready) & USBD_EPIN_BIT_MASK)) & (1U <<ep2bit(m_last_setup_dir))) {
        NRF_LOG_DEBUG("USBD drv: Trying to abort last transfer on EP0\r\n");
        usbd_ep_abort(m_last_setup_dir);
    }

    m_last_setup_dir = ((bmRequestType & USBD_DRV_REQUESTTYPE_DIR_MASK) == USBD_DRV_REQUESTTYPE_DIR_OUT) ?
                       NRF_DRV_USBD_EPOUT0 : NRF_DRV_USBD_EPIN0;

    UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~((1U<<ep2bit(NRF_DRV_USBD_EPOUT0)) | (1U<<ep2bit(NRF_DRV_USBD_EPIN0)))));
    m_ep_ready |= 1U<<ep2bit(NRF_DRV_USBD_EPIN0);


    const nrf_drv_usbd_evt_t evt = {
        .type = NRF_DRV_USBD_EVT_SETUP
    };
    m_event_handler(&evt);
}

static void USBD_ISR_Event(void)
{
    uint32_t event = nrf_usbd_eventcause_get_and_clear();

    if(event & NRF_USBD_EVENTCAUSE_ISOOUTCRC_MASK) {
        /* Currently no support */
    }
    if(event & NRF_USBD_EVENTCAUSE_SUSPEND_MASK) {
        const nrf_drv_usbd_evt_t evt = {
            .type = NRF_DRV_USBD_EVT_SUSPEND
        };
        m_event_handler(&evt);
    }
    if(event & NRF_USBD_EVENTCAUSE_RESUME_MASK) {
        const nrf_drv_usbd_evt_t evt = {
            .type = NRF_DRV_USBD_EVT_RESUME
        };
        m_event_handler(&evt);
    }
}

static void USBD_ISR_EpDataStatus(void)
{
    /* Get all endpoints that have acknowledged transfer */
    uint32_t dataepstatus = nrf_usbd_epdatastatus_get_and_clear();
#if NRF_DRV_USBD_PROTO1_FIX
    dataepstatus |= m_simulated_dataepstatus;
    m_simulated_dataepstatus = 0;
#endif
    NRF_LOG_DEBUG("USBD event: EndpointEPStatus: %x\r\n", dataepstatus);

    /* All finished endpoint have to be marked as busy */
    while(dataepstatus) {
        uint8_t           bitpos = __CLZ(__RBIT(dataepstatus));
        nrf_drv_usbd_ep_t ep     = bit2ep(bitpos);
        dataepstatus &= ~(1UL << bitpos);

        UNUSED_RETURN_VALUE(usbd_ep_data_handler(ep, bitpos));
    }
#if NRF_DRV_USBD_EARLY_DMA_PROCESS
    /* Speed up */
    usbd_dmareq_process();
#endif
}

static void USBD_ISR_AccessFault(void)
{
    /** @todo RK Currently do nothing about it.
     *  Implement it when accessfault would be better documented */
    // ASSERT(0);
}

/**
 * @brief Function to select the endpoint to start
 *
 * Function that realizes algorithm to schedule right channel for EasyDMA transfer.
 * It gets a variable with flags for the endpoints currently requiring transfer.
 *
 * @param[in] req Bit flags for channels currently requiring transfer.
 *                Bits 0...8 used for IN endpoints.
 *                Bits 16...24 used for OUT endpoints.
 * @note
 * This function would be never called with 0 as a @c req argument.
 * @return The bit number of the endpoint that should be processed now.
 */
static uint8_t usbd_dma_scheduler_algorithm(uint32_t req)
{
    /** @todo RK This is just simple algorithm for testing and should be updated */
    return __CLZ(__RBIT(req));
}

/**
 * @brief Get the size of isochronous endpoint
 *
 * The size of isochronous endpoint is configurable.
 * This function returns the size of isochronous buffer taking into account
 * current configuration.
 *
 * @param[in] ep Endpoint number.
 *
 * @return The size of endpoint buffer.
 */
static inline size_t usbd_ep_iso_capacity(nrf_drv_usbd_ep_t ep)
{
    UNUSED_PARAMETER(ep);
    nrf_usbd_isosplit_t split = nrf_usbd_isosplit_get();
    if(NRF_USBD_ISOSPLIT_Half == split) {
        return NRF_DRV_USBD_ISOSIZE / 2;
    }
    return NRF_DRV_USBD_ISOSIZE;
}

/**
 * @brief Process all DMA requests
 *
 * Function that have to be called from USBD interrupt handler.
 * It have to be called when all the interrupts connected with endpoints transfer
 * and DMA transfer are already handled.
 */
static void usbd_dmareq_process(void)
{
    if(0 == m_dma_pending) {
        uint32_t req;
        while(0 != (req = m_ep_dma_waiting & m_ep_ready)) {
            uint8_t pos = usbd_dma_scheduler_algorithm(req);
            nrf_drv_usbd_ep_t ep = bit2ep(pos);
            nrf_drv_usbd_transfer_t * p_transfer = &(ep_state_access(ep)->transfer_left);

            uint32_t data_addr; /* The address used for transmission */
            size_t size = p_transfer->size;

            if(NRF_USBD_EPIN_CHECK(ep)) {
                if(NRF_USBD_EPISO_CHECK(ep)) {
                    /* Isochronous endpoints supports only one transfer per frame
                     * and have to fit in the buffer */
                    ASSERT(size <= usbd_ep_iso_capacity(ep));
                } else {
                    /* Bulk transfers can be split to multiple transfers */
                    uint16_t max_packet_size = nrf_drv_usbd_ep_max_packet_size_get(ep);
                    if(size > max_packet_size) {
                        size = max_packet_size;
                    }
                }
            } else {
                /* Host -> Device */
                if(size != 0) {
                    ASSERT(nrf_drv_is_in_RAM((const void*)(p_transfer->p_data.ptr)));
                    uint16_t rx_size = nrf_drv_usbd_epout_size_get(ep);
                    if(rx_size > size) {
                        ep_state_access(ep)->status = NRF_USBD_EP_OVERLOAD;
                        UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<pos)));
                        /* Error - cannot fit endpoint data into buffer */

                        NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OVERLOAD);
                        m_event_handler(&evt);
                        /* This endpoint would not be transmitted now, repeat the loop */
                        continue;
                    }
                    size = rx_size;
                }
            }

            if(0 == size) {
                data_addr = 0;
            } else if(nrf_drv_is_in_RAM((const void*)(p_transfer->p_data.ptr))) {
                data_addr = p_transfer->p_data.ptr;
            } else {
                /* Size of FLASH transfer is limited to the buffer size - this is also the limit for ISO endpoint */
                ASSERT(size <= sizeof(m_tx_buffer));
                /* Only IN endpoints supports FLASH transfers */
                ASSERT(NRF_USBD_EPIN_CHECK(ep));
                /* Copy data into internal buffer */
                data_addr = (uint32_t)m_tx_buffer;
                memcpy(m_tx_buffer, (const void *)(p_transfer->p_data.ptr), size);
            }

            m_dma_pending = 1;
            m_ep_ready &= ~(1U << pos);

            NRF_LOG_DEBUG("USB dma process: Starting transfer on EP: %x, size: %u\r\n", ep, size);

            nrf_usbd_ep_easydma_set(ep, data_addr, size);
#if NRF_DRV_USBD_PROTO1_FIX
            uint32_t cnt_end = (uint32_t)(-1);
            do {
                uint32_t cnt = (uint32_t)(-1);
                do {
                    nrf_usbd_event_clear(NRF_USBD_EVENT_STARTED);
                    usbd_dma_start(ep);
                    nrf_drv_systick_delay_us(2);
                    ++cnt;
                } while(!nrf_usbd_event_check(NRF_USBD_EVENT_STARTED));
                if(cnt) {
                    NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA restarted: %u times\r\n", cnt);
                }

