thumb2/nrf51sdk12_3/components/drivers_nrf/usbd/nrf_drv_usbd.c
                nrf_drv_systick_delay_us(20);
                while(0 == (0x20 & *((volatile uint32_t *)(NRF_USBD_BASE + 0x474)))) {
                    nrf_drv_systick_delay_us(2);
                }
                nrf_drv_systick_delay_us(1);

                ++cnt_end;
            } while(!nrf_usbd_event_check(nrf_drv_usbd_ep_to_endevent(ep)));
            if(cnt_end) {
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA full restarted: %u times\r\n", cnt_end);
            }
#else
            usbd_dma_start(ep);
#endif

            /* Prepare next transfer */
            p_transfer->p_data.ptr += size;
            p_transfer->size       -= size;

            /* Transfer started - exit the loop */
            break;
        }
    }
}
/** @} */

typedef void (*nrf_drv_usbd_isr_t)(void);

/**
 * @brief USBD interrupt service runtimes
 *
 */
static const nrf_drv_usbd_isr_t m_isr[] = {
    [USBD_INTEN_USBRESET_Pos   ] = USBD_ISR_Usbreset,
    [USBD_INTEN_STARTED_Pos    ] = USBD_ISR_Started,
    [USBD_INTEN_ENDEPIN0_Pos   ] = USBD_ISR_dma_epin0,
    [USBD_INTEN_ENDEPIN1_Pos   ] = USBD_ISR_dma_epin1,
    [USBD_INTEN_ENDEPIN2_Pos   ] = USBD_ISR_dma_epin2,
    [USBD_INTEN_ENDEPIN3_Pos   ] = USBD_ISR_dma_epin3,
    [USBD_INTEN_ENDEPIN4_Pos   ] = USBD_ISR_dma_epin4,
    [USBD_INTEN_ENDEPIN5_Pos   ] = USBD_ISR_dma_epin5,
    [USBD_INTEN_ENDEPIN6_Pos   ] = USBD_ISR_dma_epin6,
    [USBD_INTEN_ENDEPIN7_Pos   ] = USBD_ISR_dma_epin7,
    [USBD_INTEN_EP0DATADONE_Pos] = USBD_ISR_SetupData,
    [USBD_INTEN_ENDISOIN_Pos   ] = USBD_ISR_dma_epin8,
    [USBD_INTEN_ENDEPOUT0_Pos  ] = USBD_ISR_dma_epout0,
    [USBD_INTEN_ENDEPOUT1_Pos  ] = USBD_ISR_dma_epout1,
    [USBD_INTEN_ENDEPOUT2_Pos  ] = USBD_ISR_dma_epout2,
    [USBD_INTEN_ENDEPOUT3_Pos  ] = USBD_ISR_dma_epout3,
    [USBD_INTEN_ENDEPOUT4_Pos  ] = USBD_ISR_dma_epout4,
    [USBD_INTEN_ENDEPOUT5_Pos  ] = USBD_ISR_dma_epout5,
    [USBD_INTEN_ENDEPOUT6_Pos  ] = USBD_ISR_dma_epout6,
    [USBD_INTEN_ENDEPOUT7_Pos  ] = USBD_ISR_dma_epout7,
    [USBD_INTEN_ENDISOOUT_Pos  ] = USBD_ISR_dma_epout8,
    [USBD_INTEN_SOF_Pos        ] = USBD_ISR_Sof,
    [USBD_INTEN_USBEVENT_Pos   ] = USBD_ISR_Event,
    [USBD_INTEN_EP0SETUP_Pos   ] = USBD_ISR_Setup,
    [USBD_INTEN_EPDATA_Pos     ] = USBD_ISR_EpDataStatus,
    [USBD_INTEN_ACCESSFAULT_Pos] = USBD_ISR_AccessFault
};

/**
 * @name Interrupt handlers
 *
 * @{
 */
void USBD_IRQHandler(void)
{
    const uint32_t enabled = nrf_usbd_int_enable_get();
    uint32_t to_process = enabled;
    uint32_t active = 0;

    /* Check all enabled interrupts */
    while(to_process) {
        uint8_t event_nr = __CLZ(__RBIT(to_process));
        if(nrf_usbd_event_get_and_clear((nrf_usbd_event_t)nrf_drv_bitpos_to_event(event_nr))) {
            active |= 1UL << event_nr;
        }
        to_process &= ~(1UL << event_nr);
    }

#if NRF_DRV_USBD_PROTO1_FIX
    do {
        active |= enabled & m_simulated_events;
        m_simulated_events = 0;
#endif
#if NRF_DRV_USBD_PROTO1_FIX
        /* Event correcting */
        if((0 == m_dma_pending) && (0 != (active & (USBD_INTEN_SOF_Msk)))) {
            uint8_t usbi, uoi, uii;
            /* Testing */
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
            uii = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            if(0 != uii) {
                uii &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            }

            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
            uoi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            if(0 != uoi) {
                uoi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            }
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
            usbi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            if(0 != usbi) {
                usbi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
            }
            /* Processing */
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AC;
            uii &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            if(0 != uii) {
                uint8_t rb;
                m_simulated_dataepstatus |= ((uint32_t)uii)<<USBD_EPIN_BITPOS_0;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uii;
                rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                UNUSED_VARIABLE(rb);
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uii: 0x%.2x (0x%.2x)\r\n", uii, rb);
            }

            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AD;
            uoi &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            if(0 != uoi) {
                uint8_t rb;
                m_simulated_dataepstatus |= ((uint32_t)uoi)<<USBD_EPOUT_BITPOS_0;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uoi;
                rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                UNUSED_VARIABLE(rb);
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uoi: 0x%.2u (0x%.2x)\r\n", uoi, rb);
            }

            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AE;
            usbi &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            if(0 != usbi) {
                uint8_t rb;
                if(usbi & 0x01) {
                    active |= USBD_INTEN_EP0SETUP_Msk;;
                }
                if(usbi & 0x10) {
                    active |= USBD_INTEN_USBRESET_Msk;
                }
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
                *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = usbi;
                rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
                UNUSED_VARIABLE(rb);
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   usbi: 0x%.2u (0x%.2x)\r\n", usbi, rb);
            }
            if(0 != m_simulated_dataepstatus) {
                active |= enabled & NRF_USBD_INT_DATAEP_MASK;
            }
        }
#endif

        /* Process active interrupts */
        while(active) {
            uint8_t event_nr = __CLZ(__RBIT(active));
#if 0
            /* Move SetupData priority after DMA priority */
            if(USBD_INTEN_EP0DATADONE_Pos == event_nr) {
                uint32_t active_temp = active & ~(1U<<USBD_INTEN_EP0DATADONE_Pos);
                if(0 != active_temp) {
                    event_nr = __CLZ(__RBIT(active_temp));
                    if(event_nr >= USBD_INTEN_SOF_Pos) {
                        /* Get back the EP0Data done event */
                        event_nr = USBD_INTEN_EP0DATADONE_Pos;
                    }
                }
            }
#endif


            m_isr[event_nr]();
            active &= ~(1UL << event_nr);
        }

        usbd_dmareq_process();
#if NRF_DRV_USBD_PROTO1_FIX
    } while(0 != (enabled & m_simulated_events));
#endif
}

/** @} */
/** @} */

ret_code_t nrf_drv_usbd_init(nrf_drv_usbd_event_handler_t const event_handler)
{
    UNUSED_VARIABLE(usbd_ep_iso_capacity);

#if NRF_DRV_USBD_PROTO1_FIX
    nrf_drv_systick_init();
#endif
    if(NULL == event_handler) {
        return NRF_ERROR_INVALID_PARAM;
    }
    if( m_drv_state != NRF_DRV_STATE_UNINITIALIZED) {
        return NRF_ERROR_INVALID_STATE;
    }

