thumb2/nrf51sdk12_3/components/drivers_nrf/usbd/nrf_drv_usbd.c
    nrf_drv_clock_hfclk_request(NULL);
    while (!nrf_drv_clock_hfclk_is_running()) {
        /* Just waiting */
    }

    m_event_handler = event_handler;
    m_drv_state = NRF_DRV_STATE_INITIALIZED;

    uint8_t n;
    for(n=0; n<NRF_USBD_EPIN_CNT; ++n) {
        nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPIN(n);
        nrf_drv_usbd_ep_max_packet_size_set(ep, NRF_USBD_EPISO_CHECK(ep) ? (NRF_DRV_USBD_ISOSIZE / 2) : NRF_DRV_USBD_EPSIZE);
        usbd_drv_ep_state_t * p_state = ep_state_access(ep);
        p_state->status = NRF_USBD_EP_OK;
        p_state->transfer_left.size = 0;
        p_state->transfer_set.size  = 0;
    }
    for(n=0; n<NRF_USBD_EPOUT_CNT; ++n) {
        nrf_drv_usbd_ep_t ep = NRF_DRV_USBD_EPOUT(n);
        nrf_drv_usbd_ep_max_packet_size_set(ep, NRF_USBD_EPISO_CHECK(ep) ? (NRF_DRV_USBD_ISOSIZE / 2) : NRF_DRV_USBD_EPSIZE);
        usbd_drv_ep_state_t * p_state = ep_state_access(ep);
        p_state->status = NRF_USBD_EP_OK;
        p_state->transfer_left.size = 0;
        p_state->transfer_set.size  = 0;
    }

    return NRF_SUCCESS;
}

ret_code_t nrf_drv_usbd_uninit(void)
{
    if( m_drv_state != NRF_DRV_STATE_INITIALIZED) {
        return NRF_ERROR_INVALID_STATE;
    }

    nrf_drv_clock_lfclk_release();
    m_event_handler = NULL;
    m_drv_state = NRF_DRV_STATE_UNINITIALIZED;
    return NRF_SUCCESS;
}

void nrf_drv_usbd_enable(void)
{
    ASSERT(m_drv_state == NRF_DRV_STATE_INITIALIZED);

    /* Prepare for READY event receiving */
    nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);
    /* Enable the peripheral */
    nrf_usbd_enable();
    /* Waiting for peripheral to enable, this should take a few us */
    while(0 == (NRF_USBD_EVENTCAUSE_READY_MASK & nrf_usbd_eventcause_get())) {
        /* Empty loop */
    }
    nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);

    nrf_usbd_isosplit_set(NRF_USBD_ISOSPLIT_Half);

    m_ep_ready = (((1U<<NRF_USBD_EPIN_CNT) - 1U) << USBD_EPIN_BITPOS_0);
    m_ep_dma_waiting = 0;
    m_dma_pending    = 0;
    m_last_setup_dir = NRF_DRV_USBD_EPOUT0;

    m_drv_state = NRF_DRV_STATE_POWERED_ON;
}

void nrf_drv_usbd_disable(void)
{
    ASSERT(m_drv_state != NRF_DRV_STATE_UNINITIALIZED);

    /* Stop just in case */
    nrf_drv_usbd_stop();

    /* Disable all parts */
    nrf_usbd_int_disable(nrf_usbd_int_enable_get());
    nrf_usbd_disable();
    m_dma_pending = 0;
    m_drv_state = NRF_DRV_STATE_INITIALIZED;
}

void nrf_drv_usbd_start(bool enable_sof)
{
    ASSERT(m_drv_state == NRF_DRV_STATE_POWERED_ON);

    uint32_t ints_to_enable =
        NRF_USBD_INT_USBRESET_MASK     |
        NRF_USBD_INT_STARTED_MASK      |
        NRF_USBD_INT_ENDEPIN0_MASK     |
        NRF_USBD_INT_EP0DATADONE_MASK  |
        NRF_USBD_INT_ENDEPOUT0_MASK    |
        NRF_USBD_INT_USBEVENT_MASK     |
        NRF_USBD_INT_EP0SETUP_MASK     |
        NRF_USBD_INT_DATAEP_MASK       |
        NRF_USBD_INT_ACCESSFAULT_MASK;

    if(enable_sof || NRF_DRV_USBD_PROTO1_FIX) {
        ints_to_enable |= NRF_USBD_INT_SOF_MASK;
    }

    /* Enable all required interrupts */
    nrf_usbd_int_enable(ints_to_enable);

    /* Enable interrupt globally */
    usbd_int_enable();

    /* Enable pullups */
    nrf_usbd_pullup_enable();
}

void nrf_drv_usbd_stop(void)
{
    ASSERT(m_drv_state == NRF_DRV_STATE_POWERED_ON);

    /* Abort transfers */
    usbd_ep_abort_all();

    /* Disable pullups */
    nrf_usbd_pullup_disable();

    /* Disable interrupt globally */
    usbd_int_disable();
}

bool nrf_drv_usbd_is_initialized(void)
{
    return (m_drv_state >= NRF_DRV_STATE_INITIALIZED);
}

bool nrf_drv_usbd_is_enabled(void)
{
    return (m_drv_state >= NRF_DRV_STATE_POWERED_ON);
}

bool nrf_drv_usbd_is_started(void)
{
    return (nrf_drv_usbd_is_enabled() && usbd_int_state());
}

void nrf_drv_usbd_ep_max_packet_size_set(nrf_drv_usbd_ep_t ep, uint16_t size)
{
    /* Only power of 2 size allowed */
    ASSERT((size != 0) && (size & (size - 1)) == 0);
    /* Packet size cannot be higher than maximum buffer size */
    ASSERT( ( NRF_USBD_EPISO_CHECK(ep)  && (size <= usbd_ep_iso_capacity(ep)))
            ||
            ((!NRF_USBD_EPISO_CHECK(ep)) && (size <= NRF_DRV_USBD_EPSIZE)));

    usbd_drv_ep_state_t * p_state = ep_state_access(ep);
    p_state->max_packet_size = size;
}

uint16_t nrf_drv_usbd_ep_max_packet_size_get(nrf_drv_usbd_ep_t ep)
{
    usbd_drv_ep_state_t const * p_state = ep_state_access(ep);
    return p_state->max_packet_size;
}

void nrf_drv_usbd_ep_enable(nrf_drv_usbd_ep_t ep)
{
    nrf_usbd_ep_enable(ep_to_hal(ep));
    nrf_usbd_int_enable(nrf_drv_usbd_ep_to_int(ep));

    if((NRF_USBD_EP_NR_GET(ep) != 0) && NRF_USBD_EPOUT_CHECK(ep)) {
        CRITICAL_REGION_ENTER();

        m_ep_ready |= 1U<<ep2bit(ep);
        usbd_drv_ep_state_t * p_state = ep_state_access(ep);

        if (!NRF_USBD_EPISO_CHECK(ep)) {
            ret_code_t ret;
            NRF_DRV_USBD_TRANSFER_OUT(transfer, 0, 0);
            ret = nrf_drv_usbd_ep_transfer(ep, &transfer, NULL);
            ASSERT(ret == NRF_SUCCESS);
            UNUSED_VARIABLE(ret);
        }
        p_state->status = NRF_USBD_EP_ABORTED;

        CRITICAL_REGION_EXIT();
    }
}

void nrf_drv_usbd_ep_disable(nrf_drv_usbd_ep_t ep)
{
    nrf_usbd_ep_disable(ep_to_hal(ep));
    nrf_usbd_int_disable(nrf_drv_usbd_ep_to_int(ep));
}

ret_code_t nrf_drv_usbd_ep_transfer(
    nrf_drv_usbd_ep_t                                  ep,
    nrf_drv_usbd_transfer_t              const * const p_transfer,
    nrf_drv_usbd_transfer_handler_desc_t const * const p_handler)
{
    uint8_t ep_bitpos = ep2bit(ep);
    ret_code_t ret;
    ASSERT(NULL != p_transfer);

    NRF_LOG_DEBUG("USB drv: Transfer called on endpoint %x, size: %u\r\n", ep, p_transfer->size);
    CRITICAL_REGION_ENTER();
    /* Setup data transaction can go only in one direction at a time */
    if((NRF_USBD_EP_NR_GET(ep) == 0) && (ep != m_last_setup_dir)) {
        ret = NRF_ERROR_INVALID_ADDR;
    } else if((m_ep_dma_waiting | ((~m_ep_ready) & USBD_EPIN_BIT_MASK)) & (1U << ep_bitpos)) {
        /* IN (Device -> Host) transfer has to be transmitted out to allow new transmission */
        ret = NRF_ERROR_BUSY;
    } else if(nrf_usbd_ep_is_stall(ep)) {
        ret = NRF_ERROR_FORBIDDEN;
    } else {
        /* We can configure the transfer now */
        usbd_drv_ep_state_t * p_state =  ep_state_access(ep);
        if(NULL != p_handler) {
            p_state->handler_desc = *p_handler;
        } else {
            p_state->handler_desc.handler = NULL;
        }

