thumb2/nrf51sdk12_3/components/drivers_nrf/usbd/nrf_drv_usbd.c
        p_state->transfer_set = *p_transfer;
        p_state->transfer_left = *p_transfer;
        p_state->status = NRF_USBD_EP_OK;
        m_ep_dma_waiting |= 1U << ep_bitpos;

        ret = NRF_SUCCESS;
        usbd_int_rise();
    }

    CRITICAL_REGION_EXIT();
    return ret;
}

ret_code_t nrf_drv_usbd_ep_status_get(nrf_drv_usbd_ep_t ep, nrf_drv_usbd_transfer_t * p_transfer)
{
    ret_code_t ret;

    CRITICAL_REGION_ENTER();
    if(m_ep_dma_waiting & (1U << ep2bit(ep))) {
        ret = NRF_ERROR_BUSY;
    } else {
        usbd_drv_ep_state_t * p_state = ep_state_access(ep);
        p_transfer->p_data = p_state->transfer_set.p_data;
        p_transfer->size   = p_state->transfer_set.size - p_state->transfer_left.size;
        ret = p_state->status;
    }

    CRITICAL_REGION_EXIT();
    return ret;
}

size_t     nrf_drv_usbd_epout_size_get(nrf_drv_usbd_ep_t ep)
{
    return nrf_usbd_epout_size_get(ep_to_hal(ep));
}

bool       nrf_drv_usbd_ep_is_busy(nrf_drv_usbd_ep_t ep)
{
    return (0 != (m_ep_dma_waiting & (1UL << ep2bit(ep))));
}

void nrf_drv_usbd_ep_stall(nrf_drv_usbd_ep_t ep)
{
    NRF_LOG_DEBUG("USB: EP %x stalled.\r\n", ep);
    nrf_usbd_ep_stall(ep_to_hal(ep));
}

void nrf_drv_usbd_ep_stall_clear(nrf_drv_usbd_ep_t ep)
{
    nrf_usbd_ep_unstall(ep_to_hal(ep));
}

bool nrf_drv_usbd_ep_stall_check(nrf_drv_usbd_ep_t ep)
{
    return nrf_usbd_ep_is_stall(ep_to_hal(ep));
}

void nrf_drv_usbd_setup_get(nrf_drv_usbd_setup_t * const p_setup)
{
    memset(p_setup, 0, sizeof(nrf_drv_usbd_setup_t));
    p_setup->bmRequestType = nrf_usbd_setup_bmrequesttype_get();
    p_setup->bmRequest     = nrf_usbd_setup_brequest_get();
    p_setup->wValue        = nrf_usbd_setup_wvalue_get();
    p_setup->wIndex        = nrf_usbd_setup_windex_get();
    p_setup->wLength       = nrf_usbd_setup_wlength_get();
}

void nrf_drv_usbd_setup_data_clear(void)
{
    nrf_usbd_task_trigger(NRF_USBD_TASK_EP0RCVOUT);
}

void nrf_drv_usbd_setup_clear(void)
{
    nrf_usbd_task_trigger(NRF_USBD_TASK_EP0RCVOUT);
    nrf_usbd_task_trigger(NRF_USBD_TASK_EP0STATUS);
}

void nrf_drv_usbd_setup_stall(void)
{
    NRF_LOG_DEBUG("Setup stalled.\r\n");
    nrf_usbd_task_trigger(NRF_USBD_TASK_EP0STALL);
}

nrf_drv_usbd_ep_t nrf_drv_usbd_last_setup_dir_get(void)
{
    return m_last_setup_dir;
}

void nrf_drv_usbd_transfer_out_drop(nrf_drv_usbd_ep_t ep)
{
    ASSERT(NRF_USBD_EPOUT_CHECK(ep));

    if(m_ep_ready & (1U << ep2bit(ep))) {
        if (!NRF_USBD_EPISO_CHECK(ep)) {
            ret_code_t ret;
            NRF_DRV_USBD_TRANSFER_OUT(transfer, 0, 0);
            ret = nrf_drv_usbd_ep_transfer(ep, &transfer, NULL);
            ASSERT(ret == NRF_SUCCESS);
            UNUSED_VARIABLE(ret);
        }
    }
}

#endif // USBD_ENABLED
